{
    "Hadiths":[
        {
            "hadith":"Whoever has been given his portion of compassion has been given his portion of good. Whoever is denied given his portion of compassion has been denied his portion of good. Good character will be the weightiest thing in the believer's balance on the Day of Rising. Allah hates a coarse, foul-mouthed person.",
            "reference":"Al-Adab Al-Mufrad 464"
        },
        {
            "hadith":"Whoever is denied compassion is denied good.",
            "reference":"Al-Adab Al-Mufrad 463"
        }, 
        {
            "hadith":"Forgive right-acting people their slips.",
            "reference":"Al-Adab Al-Mufrad 465"
        },
        {
            "hadith":"If there is roughness in anything it is bound to disgrace it. Allah is compassionate and loves compassion.",
            "reference":"Al-Adab Al-Mufrad 466"
        }, 
        {
            "hadith":"Abu Sa'id al-Khudri said, 'The Messenger of Allah, may Allah bless him and grant him peace, was more modest than a virgin in her tent. When he disliked something, we recognised that in his face.' ",
            "reference":"Al-Adab Al-Mufrad 467"
        }, 
        {
            "hadith":"Right guidance, good behaviour and aiming for what is just and correct is a seventieth part of prophethood.",
            "reference":"Al-Adab Al-Mufrad 468"
        }, 
        {
            "hadith":"'A'isha, may Allah be pleased with her, said, 'I was on a camel which was somewhat intractable and the Prophet, may Allah bless him and grant him peace, remarked, 'You must be compassionate. Whenever there is compassion in something, it adorns it, and when it is removed from something it disgraces it.'",
            "reference":"Al-Adab Al-Mufrad 469"
        }, {
            "hadith":"Beware of avarice. It destroyed those before you. They shed one another's blood and broke off relations with their relatives. Injustice will appear as darkness on the Day of Rising.",
            "reference":"Al-Adab Al-Mufrad 470"
        }, {
            "hadith":"Allah is compassionate and loves compassion. He gives for compassion what He goes not give for harshness.",
            "reference":"Al-Adab Al-Mufrad 472"
        }, 
        {
            "hadith":"Make things easy and do not make things difficult. Calm people and do not arouse their aversion.",
            "reference":"Al-Adab Al-Mufrad 473"
        }
    ],
    "colors":[
        "#274d8a",
        "#691706",
        "#192e06",
        "#062e29",
        "#061f2e",
        "#06092e",
        "#34225e",
        "#5c225e",
        "#540b41",
        "#a82a2c"
    ] 
}
